src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="07a2b3d4-fd68-40b9-a6e9-e376aef5a0b5">
  <name>ФизическиеЛица</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="04f0f986-b711-412a-a9f3-02513ca2b7c5">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ac3d2309-478e-4c3d-937b-7c47becebdd9">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="675cc4a4-cdfc-4976-a647-2efc4c0c90b8">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/stdl_ФизическиеЛица/Module.bsl
// @strict-types
#Область ПрограммныйИнтерфейс
// Получить.
// 
// Параметры:
//  УИД - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  - Неопределено
//  - СправочникСсылка.ФизическиеЛица
Функция Получить(УИД) Экспорт
	ФизическоеЛицо = Справочники.ФизическиеЛица.ПолучитьСсылку(УИД);
	Если ФизическоеЛицо.ПолучитьОбъект() = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ФизическоеЛицо;
КонецФункции

// Получить по электронной почте.
// 
// Параметры:
//  ЭлектроннаяПочта - Строка
// 
// Возвращаемое значение:
//  - Неопределено
//  - СправочникСсылка.ФизическиеЛица
Функция ПолучитьПоЭлектроннойПочте(ЭлектроннаяПочта) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК ФизическоеЛицо
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|ГДЕ
	|	ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.Email)
	|	И ФизическиеЛицаКонтактнаяИнформация.АдресЭП = &ЭлектроннаяПочта";

	Запрос.УстановитьПараметр("ЭлектроннаяПочта", ЭлектроннаяПочта);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	//@skip-check property-return-type
	Возврат Выборка.ФизическоеЛицо;
КонецФункции
#КонецОбласти
